---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ElemReferenceName2dXz
source: html/98260bd8-0afb-3baf-3d51-8f86cb210bd4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ElemReferenceName2dXz Property

"Is Reference"

## Syntax (C#)
```csharp
public static ForgeTypeId ElemReferenceName2dXz { get; }
```